; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v1)
             (pred_9 ?v7 ?v12)
             (pred_6 ?v6 ?v12)
             (pred_5 ?v5 ?v6 )
	     (pred_1 ?v6)
             (pred_11 ?v2)
             (pred_4 ?v7)
             (pred_8 ?v12)
             (pred_12 ?v6)
             (pred_2 ?v7)
             (pred_10 ?v6)
             (pred_3 ))



(:action op_3
:parameters (?v4 ?v13 ?v8 ?v3)
:precondition (and (pred_11 ?v4) (pred_11 ?v13) (pred_4 ?v8) (pred_8 ?v3)
          (pred_7 ?v4 ?v13) (pred_9 ?v8 ?v3)
                   (pred_6 ?v13 ?v3) (pred_1 ?v4) 
                   (pred_12 ?v13) (pred_2 ?v8))
:effect (and  (pred_10 ?v13) (not (pred_12 ?v13))))


(:action op_5
:parameters (?v4 ?v10)
:precondition (and (pred_11 ?v4) (pred_11 ?v10)
               (pred_1 ?v4) (pred_7 ?v4 ?v10) (pred_10 ?v10))
:effect (and (pred_1 ?v10) (not (pred_1 ?v4))))

(:action op_4
:parameters (?v4 ?v8)
:precondition (and (pred_11 ?v4) (pred_4 ?v8) 
                  (pred_1 ?v4) (pred_5 ?v8 ?v4) (pred_3 ))
:effect (and (pred_2 ?v8)
   (not (pred_5 ?v8 ?v4)) (not (pred_3 ))))


(:action op_1
:parameters (?v4 ?v11 ?v9)
:precondition (and (pred_11 ?v4) (pred_4 ?v11) (pred_4 ?v9)
                  (pred_1 ?v4) (pred_2 ?v9) (pred_5 ?v11 ?v4))
:effect (and (pred_2 ?v11) (pred_5 ?v9 ?v4)
        (not (pred_2 ?v9)) (not (pred_5 ?v11 ?v4))))

(:action op_2
:parameters (?v4 ?v8)
:precondition (and (pred_11 ?v4) (pred_4 ?v8) 
                  (pred_1 ?v4) (pred_2 ?v8))
:effect (and (pred_3 ) (pred_5 ?v8 ?v4) (not (pred_2 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_29 obj_07 obj_26 obj_22 obj_12 obj_06 obj_27 obj_02 obj_30 obj_25 obj_01 obj_19 obj_03 obj_11 obj_24 obj_16 obj_23 obj_18 obj_09 obj_17 obj_05 obj_15 obj_13 obj_04
    obj_21 obj_14 obj_31
    obj_28 obj_10 obj_20
    )

    (:init
       (pred_3)

       (pred_11 obj_08)
       (pred_11 obj_29)
       (pred_11 obj_07)
       (pred_11 obj_26)
       (pred_11 obj_22)
       (pred_11 obj_12)
       (pred_11 obj_06)
       (pred_11 obj_27)
       (pred_11 obj_02)
       (pred_11 obj_30)
       (pred_11 obj_25)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_11 obj_24)
       (pred_11 obj_16)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_09)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_04)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_31)
       (pred_4 obj_28)
       (pred_4 obj_10)
       (pred_4 obj_20)

       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_29)
       (pred_7 obj_29 obj_06)
       (pred_7 obj_29 obj_07)
       (pred_7 obj_29 obj_08)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_07 obj_26)
       (pred_7 obj_07 obj_29)
       (pred_7 obj_26 obj_02)
       (pred_7 obj_26 obj_22)
       (pred_7 obj_26 obj_07)
       (pred_7 obj_22 obj_30)
       (pred_7 obj_22 obj_26)
       (pred_7 obj_12 obj_25)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_27)
       (pred_7 obj_06 obj_29)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_27 obj_19)
       (pred_7 obj_27 obj_02)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_27 obj_06)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_02 obj_26)
       (pred_7 obj_02 obj_27)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_30 obj_22)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_25 obj_24)
       (pred_7 obj_25 obj_01)
       (pred_7 obj_25 obj_12)
       (pred_7 obj_01 obj_16)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_25)
       (pred_7 obj_19 obj_23)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_27)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_11 obj_09)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_24 obj_17)
       (pred_7 obj_24 obj_16)
       (pred_7 obj_24 obj_25)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_01)
       (pred_7 obj_16 obj_24)
       (pred_7 obj_23 obj_15)
       (pred_7 obj_23 obj_18)
       (pred_7 obj_23 obj_19)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_23)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_11)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_24)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_15 obj_23)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_13)
       (pred_12 obj_26)
       (pred_12 obj_18)
       (pred_12 obj_05)
       (pred_6  obj_26 obj_21)
       (pred_6  obj_18 obj_14)
       (pred_6  obj_05 obj_31)
       (pred_10 obj_08)
       (pred_10 obj_29)
       (pred_10 obj_07)
       (pred_10 obj_22)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_27)
       (pred_10 obj_02)
       (pred_10 obj_30)
       (pred_10 obj_25)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_24)
       (pred_10 obj_16)
       (pred_10 obj_23)
       (pred_10 obj_09)
       (pred_10 obj_17)
       (pred_10 obj_15)
       (pred_10 obj_13)
       (pred_10 obj_04)

       (pred_9  obj_28 obj_21)
       (pred_9  obj_10 obj_14)
       (pred_9  obj_20 obj_31)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_10 obj_23)
       (pred_5 obj_20 obj_08)
       (pred_1 obj_27)
    )

    (:goal (and
       (pred_5 obj_20 obj_06)
    ))
(:constraints
  (always (not (pred_1 obj_29)))
)
)

; plan
1. (op_5 obj_27 obj_06)
   deleted: (pred_1 obj_27)
   added: (pred_1 obj_06)
   goals met: 0 of 1
2. (op_5 obj_06 obj_12)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_12)
   goals met: 0 of 1
3. (op_5 obj_12 obj_08)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_08)
   goals met: 0 of 1
4. (op_4 obj_08 obj_20)
   deleted: (pred_5 obj_20 obj_08) (pred_3)
   added: (pred_2 obj_20)
   goals met: 0 of 1
5. (op_5 obj_08 obj_12)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_12)
   goals met: 0 of 1
6. (op_5 obj_12 obj_06)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_06)
   goals met: 0 of 1
7. (op_2 obj_06 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_3) (pred_5 obj_20 obj_06)
   goals met: 1 of 1
